src/main/resources/samples/onvif-discovery-response-2.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope"
              xmlns:tds="http://www.onvif.org/ver10/device/wsdl"
              xmlns:dn="http://www.onvif.org/ver10/network/wsdl"
              xmlns:http="http://schemas.xmlsoap.org/wsdl/http"
              xmlns:d="http://schemas.xmlsoap.org/ws/2005/04/discovery"
              xmlns:wsadis="http://schemas.xmlsoap.org/ws/2004/08/addressing"
>
    <env:Header>
        <wsadis:MessageID>urn:uuid:a77ac000-6c92-11b3-81aa-24b105398d91</wsadis:MessageID>
        <wsadis:RelatesTo>
            uuid:24f99af0-17ee-4759-b8ab-9412b7595246
        </wsadis:RelatesTo>
        <wsadis:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsadis:To>
        <wsadis:Action>http://schemas.xmlsoap.org/ws/2005/04/discovery/ProbeMatches</wsadis:Action>
        <d:AppSequence InstanceId="1735838197" MessageNumber="3584"/>
    </env:Header>
    <env:Body>
        <d:ProbeMatches>
            <d:ProbeMatch>
                <wsadis:EndpointReference>
                    <wsadis:Address>urn:uuid:a77ac000-6c92-11b3-81aa-24b105398d91</wsadis:Address>
                </wsadis:EndpointReference>
                <d:Types>dn:NetworkVideoTransmitter tds:Device</d:Types>
                <d:Scopes>onvif://www.onvif.org/type/video_encoder onvif://www.onvif.org/Profile/Streaming
                    onvif://www.onvif.org/Profile/G onvif://www.onvif.org/Profile/T
                    onvif://www.onvif.org/type/audio_encoder onvif://www.onvif.org/MAC/24:b1:05:39:8d:91
                    onvif://www.onvif.org/hardware/DS-2CD3023G2-IU
                    onvif://www.onvif.org/name/HIKVISION%20DS-2CD3023G2-IU onvif://www.onvif.org/location/city/hangzhou
                </d:Scopes>
                <d:XAddrs>http://172.16.0.27/onvif/device_service
                    http://[fe80::26b1:5ff:fe39:8d91]/onvif/device_service
                </d:XAddrs>
                <d:MetadataVersion>10</d:MetadataVersion>
            </d:ProbeMatch>
        </d:ProbeMatches>
    </env:Body>
</env:Envelope>